tap "bwilczynski/tap"
tap "hashicorp/tap"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "hudochenkov/sshpass"
tap "isen-ng/dotnet-sdk-versions"
tap "jakehilborn/jakehilborn"
# Official Amazon AWS command-line interface
brew "awscli"
# Core application library for C
brew "glib"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Small utility that generates Go code from any file
brew "go-bindata"
# Fast linters runner for Go
brew "golangci-lint"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line interface for JFrog products
brew "jfrog-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Cross platform, open source .NET development framework
brew "mono"
# Platform built on V8 to build network applications
brew "node"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Development kit for the Java programming language
brew "openjdk@11"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Cross-platform application and UI framework
brew "qt"
# User interface to the TELNET protocol
brew "telnet"
# JavaScript package manager
brew "yarn"
# Strava Command-Line Tools
brew "bwilczynski/tap/strava-cli"
# Vault
brew "hashicorp/tap/vault"
brew "hudochenkov/sshpass/sshpass"
# macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew "jakehilborn/jakehilborn/displayplacer"
# Command-line interface for 1Password
cask "1password-cli"
# Enable Windows-like alt-tab
cask "alt-tab"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "dotnet-sdk3-1-400"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "dotnet-sdk5-0-400"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "dotnet-sdk6-0-400"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "dotnet-sdk7-0-400"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# Avalonia-based .NET decompiler
cask "ilspy"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Extensible editor for OpenStreetMap
cask "josm"
# Keyboard customizer
cask "karabiner-elements"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Set of CPU, memory, disk, and network monitoring tools
cask "menumeters"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Finder Toolbar app to open the current directory in Editor
cask "openineditor-lite"
# Finder Toolbar app to open the current directory in Terminal
cask "openinterminal-lite"
# Desktop virtualization software
cask "parallels"
# Command-line shell and scripting language
cask "powershell"
# Allows users with an iSight (or compatible) camera to read QR codes
cask "qr-journal"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Time optimising application
cask "rescuetime"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
# Remote desktop application focusing on security
cask "vnc-viewer"
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
